milesarmstrong/resurrecting-the-rabbit/avr_setup/boards.txt
##############################################################

pro328.name=Arduino Pro or Pro Mini (3.3V, 8 MHz) w/ ATmega328

pro328.upload.protocol=arduino
pro328.upload.maximum_size=30720
pro328.upload.speed=57600

pro328.bootloader.low_fuses=0xFF
pro328.bootloader.high_fuses=0xDA
pro328.bootloader.extended_fuses=0x05
pro328.bootloader.path=atmega
pro328.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
pro328.bootloader.unlock_bits=0x3F
pro328.bootloader.lock_bits=0x0F

pro328.build.mcu=atmega328p
pro328.build.f_cpu=8000000L
pro328.build.core=arduino
pro328.build.variant=standard

##############################################################

pro.name=Arduino Pro or Pro Mini (3.3V, 8 MHz) w/ ATmega168

pro.upload.protocol=arduino
pro.upload.maximum_size=14336
pro.upload.speed=19200

pro.bootloader.low_fuses=0xc6
pro.bootloader.high_fuses=0xdd
pro.bootloader.extended_fuses=0x00
pro.bootloader.path=atmega
pro.bootloader.file=ATmegaBOOT_168_pro_8MHz.hex
pro.bootloader.unlock_bits=0x3F
pro.bootloader.lock_bits=0x0F

pro.build.mcu=atmega168
pro.build.f_cpu=8000000L
pro.build.core=arduino
pro.build.variant=standard

##############################################################

atmega168.name=Arduino NG or older w/ ATmega168

atmega168.upload.protocol=arduino
atmega168.upload.maximum_size=14336
atmega168.upload.speed=19200

atmega168.bootloader.low_fuses=0xff
atmega168.bootloader.high_fuses=0xdd
atmega168.bootloader.extended_fuses=0x00
atmega168.bootloader.path=atmega
atmega168.bootloader.file=ATmegaBOOT_168_ng.hex
atmega168.bootloader.unlock_bits=0x3F
atmega168.bootloader.lock_bits=0x0F

atmega168.build.mcu=atmega168
atmega168.build.f_cpu=16000000L
atmega168.build.core=arduino
atmega168.build.variant=standard

##############################################################

atmega8.name=Arduino NG or older w/ ATmega8

atmega8.upload.protocol=arduino
atmega8.upload.maximum_size=7168
atmega8.upload.speed=19200

atmega8.bootloader.low_fuses=0xdf
atmega8.bootloader.high_fuses=0xca
atmega8.bootloader.path=atmega8
atmega8.bootloader.file=ATmegaBOOT-prod-firmware-2009-11-07.hex
atmega8.bootloader.unlock_bits=0x3F
atmega8.bootloader.lock_bits=0x0F

atmega8.build.mcu=atmega8
atmega8.build.f_cpu=16000000L
atmega8.build.core=arduino
atmega8.build.variant=standard

##############################################################

robotControl.name=Arduino Robot Control
robotControl.upload.protocol=avr109
robotControl.upload.maximum_size=28672
robotControl.upload.speed=57600
robotControl.upload.disable_flushing=true
robotControl.bootloader.low_fuses=0xff
robotControl.bootloader.high_fuses=0xd8
robotControl.bootloader.extended_fuses=0xcb
robotControl.bootloader.path=caterina-Arduino_Robot
robotControl.bootloader.file=Caterina-Robot-Control.hex
robotControl.bootloader.unlock_bits=0x3F
robotControl.bootloader.lock_bits=0x2F
robotControl.build.mcu=atmega32u4
robotControl.build.f_cpu=16000000L
robotControl.build.vid=0x2341
robotControl.build.pid=0x8038
robotControl.build.core=robot
robotControl.build.variant=robot_control

##############################################################

robotMotor.name=Arduino Robot Motor
robotMotor.upload.protocol=avr109
robotMotor.upload.maximum_size=28672
robotMotor.upload.speed=57600
robotMotor.upload.disable_flushing=true
robotMotor.bootloader.low_fuses=0xff
robotMotor.bootloader.high_fuses=0xd8
robotMotor.bootloader.extended_fuses=0xcb
robotMotor.bootloader.path=caterina-Arduino_Robot
robotMotor.bootloader.file=Caterina-Robot-Motor.hex
robotMotor.bootloader.unlock_bits=0x3F
robotMotor.bootloader.lock_bits=0x2F
robotMotor.build.mcu=atmega32u4
robotMotor.build.f_cpu=16000000L
robotMotor.build.vid=0x2341
robotMotor.build.pid=0x8039
robotMotor.build.core=robot
robotMotor.build.variant=robot_motor

##############################################################

atmega328bb.name=ATmega328 on a breadboard (8 MHz internal clock)
atmega328bb.upload.protocol=stk500
atmega328bb.upload.maximum_size=30720
atmega328bb.upload.speed=57600
atmega328bb.bootloader.low_fuses=0xE2
atmega328bb.bootloader.high_fuses=0xD9
atmega328bb.bootloader.extended_fuses=0x06
atmega328bb.bootloader.path=arduino:atmega
atmega328bb.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
atmega328bb.bootloader.unlock_bits=0x3F
atmega328bb.bootloader.lock_bits=0x0F
atmega328bb.build.mcu=atmega328p
atmega328bb.build.f_cpu=8000000L
atmega328bb.build.core=arduino:arduino
atmega328bb.build.variant=arduino:standard

##############################################################

atmega328ppu8c.name=ATmega328P-PU (8MHz Crystal)
atmega328ppu8c.upload.maximum_size=30720
atmega328ppu8c.upload.protocol=arduino
atmega328ppu8c.upload.speed=57600
atmega328ppu8c.bootloader.low_fuses=0xE2
atmega328ppu8c.bootloader.high_fuses=0xDA
atmega328ppu8c.bootloader.extended_fuses=0x05
atmega328ppu8c.bootloader.path=arduino:atmega
atmega328ppu8c.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
atmega328ppu8c.bootloader.unlock_bits=0x3F
atmega328ppu8c.bootloader.lock_bits=0x0F
atmega328ppu8c.build.mcu=atmega328p
atmega328ppu8c.build.f_cpu=8000000L
atmega328ppu8c.build.core=arduino:arduino
atmega328ppu8c.build.variant=arduino:standard

##############################################################

atmega328ppu12c.name=ATmega328P-PU (12MHz Crystal)
atmega328ppu12c.upload.maximum_size=30720
atmega328ppu12c.upload.speed=57600
atmega328ppu12c.bootloader.low_fuses=0xFF
atmega328ppu12c.bootloader.high_fuses=0xDA
atmega328ppu12c.bootloader.extended_fuses=0x05
atmega328ppu12c.bootloader.path=arduino:atmega
atmega328ppu12c.bootloader.unlock_bits=0x3F
atmega328ppu12c.bootloader.lock_bits=0x0F
atmega328ppu12c.build.mcu=atmega328p
atmega328ppu12c.build.f_cpu=12000000L
atmega328ppu12c.build.core=arduino:arduino
atmega328ppu12c.build.variant=arduino:standard

##############################################################

atmega328ppu16c.name=ATmega328P-PU (16MHz Crystal)
atmega328ppu16c.upload.maximum_size=30720
atmega328ppu16c.upload.protocol=arduino
atmega328ppu16c.upload.speed=57600
atmega328ppu16c.bootloader.low_fuses=0xFF
atmega328ppu16c.bootloader.high_fuses=0xDA
atmega328ppu16c.bootloader.extended_fuses=0x05
atmega328ppu16c.bootloader.path=arduino:atmega
atmega328ppu16c.bootloader.file=ATmegaBOOT_168_atmega328.hex
atmega328ppu16c.bootloader.unlock_bits=0x3F
atmega328ppu16c.bootloader.lock_bits=0x0F
atmega328ppu16c.build.mcu=atmega328p
atmega328ppu16c.build.f_cpu=16000000L
atmega328ppu16c.build.core=arduino:arduino
atmega328ppu16c.build.variant=arduino:standard

