milesarmstrong/resurrecting-the-rabbit/avr_setup/boards.txt
##############################################################

atmega328ppu20c.name=ATmega328P-PU (20MHz Crystal)
atmega328ppu20c.upload.maximum_size=30720
atmega328ppu20c.upload.protocol=arduino
atmega328ppu20c.upload.speed=57600
atmega328ppu20c.bootloader.low_fuses=0xF7
atmega328ppu20c.bootloader.high_fuses=0xDA
atmega328ppu20c.bootloader.extended_fuses=0x05
atmega328ppu20c.bootloader.path=arduino:atmega
atmega328ppu20c.bootloader.unlock_bits=0x3F
atmega328ppu20c.bootloader.lock_bits=0x0F
atmega328ppu20c.build.mcu=atmega328p
atmega328ppu20c.build.f_cpu=20000000L
atmega328ppu20c.build.core=arduino:arduino
atmega328ppu20c.build.variant=arduino:standard

##############################################################

attiny8420pu1rc.name=ATtiny84-20PU (1MHz Internal RC Oscilator)
attiny8420pu1rc.bootloader.low_fuses=0x62
attiny8420pu1rc.bootloader.high_fuses=0xdf
attiny8420pu1rc.bootloader.extended_fuses=0xff
attiny8420pu1rc.upload.maximum_size=8192
attiny8420pu1rc.build.mcu=attiny84
attiny8420pu1rc.build.f_cpu=1000000L
attiny8420pu1rc.build.core=arduino:arduino
attiny8420pu1rc.build.variant=tiny14

##############################################################

attiny8420pu8rc-8.name=ATtiny84-20PU (8MHz Internal RC Oscilator)
attiny8420pu8rc-8.bootloader.low_fuses=0xe2
attiny8420pu8rc-8.bootloader.high_fuses=0xdf
attiny8420pu8rc-8.bootloader.extended_fuses=0xff
attiny8420pu8rc-8.upload.maximum_size=8192
attiny8420pu8rc-8.build.mcu=attiny84
attiny8420pu8rc-8.build.f_cpu=8000000L
attiny8420pu8rc-8.build.core=arduino:arduino
attiny8420pu8rc-8.build.variant=tiny14

##############################################################

attiny8420pu20c.name=ATtiny84-20PU (20MHz Crystal)
attiny8420pu20c.bootloader.low_fuses=0xfe
attiny8420pu20c.bootloader.high_fuses=0xdf
attiny8420pu20c.bootloader.extended_fuses=0xff
attiny8420pu20c.upload.maximum_size=8192
attiny8420pu20c.build.mcu=attiny84
attiny8420pu20c.build.f_cpu=20000000L
attiny8420pu20c.build.core=arduino:arduino
attiny8420pu20c.build.variant=tiny14

##############################################################

attiny8520pu1rc.name=ATtiny85-20PU (1MHz Internal RC Oscilator)
attiny8520pu1rc.bootloader.low_fuses=0x62
attiny8520pu1rc.bootloader.high_fuses=0xdf
attiny8520pu1rc.bootloader.extended_fuses=0xff
attiny8520pu1rc.upload.maximum_size=8192
attiny8520pu1rc.build.mcu=attiny85
attiny8520pu1rc.build.f_cpu=1000000L
attiny8520pu1rc.build.core=arduino:arduino
attiny8520pu1rc.build.variant=tiny8

##############################################################

attiny8520pu8rc.name=ATtiny85-20PU (8MHz Internal RC Oscilator)
attiny8520pu8rc.bootloader.low_fuses=0xe2
attiny8520pu8rc.bootloader.high_fuses=0xdf
attiny8520pu8rc.bootloader.extended_fuses=0xff
attiny8520pu8rc.upload.maximum_size=8192
attiny8520pu8rc.build.mcu=attiny85
attiny8520pu8rc.build.f_cpu=8000000L
attiny8520pu8rc.build.core=arduino:arduino
attiny8520pu8rc.build.variant=tiny8

##############################################################

attiny8520pu20c.name=ATtiny85-20PU (20MHz Crystal)
attiny8520pu20c.bootloader.low_fuses=0xfe
attiny8520pu20c.bootloader.high_fuses=0xdf
attiny8520pu20c.bootloader.extended_fuses=0xff
attiny8520pu20c.upload.maximum_size=8192
attiny8520pu20c.build.mcu=attiny85
attiny8520pu20c.build.f_cpu=20000000L
attiny8520pu20c.build.core=arduino:arduino
attiny8520pu20c.build.variant=tiny8



